// Вивести на сторінку в один рядок через кому числа від 10 до 20.
// Вивести квадрати чисел від 10 до 20.
// Вивести таблицю множення на 7.
// Знайти суму всіх цілих чисел від 1 до 15.
// Знайти добуток усіх цілих чисел від 15 до 35.
// Знайти середнє арифметичне всіх цілих чисел від 1 до 500.
// Вивести суму лише парних чисел в діапазоні від 30 до 80.
// Вивести всі числа в діапазоні від 100 до 200 кратні 3.
// Дано натуральне число. Знайти та вивести на сторінку всі його дільники.
// Визначити кількість його парних дільників.
// Знайти суму його парних дільників.
// Надрукувати повну таблицю множення від 1 до 10.




// Вивести на сторінку в один рядок через кому числа від 10 до 20.
// for (let i = 10; i <= 20; i++) {
//     document.write(i < 20 ? `${i},`: i)
// }

// Вивести квадрати чисел від 10 до 20.
// for (let i = 10; i <= 20; i++) {
//     sqr = i ** 2
//     document.write(i < 20 ? `${sqr},`: sqr)
// }

// Вивести таблицю множення на 7.
// for (let i = 1; i <= 10; i++) {
//     document.write(`${i} * 7 = ${i * 7}<br>`)
// }

// Знайти суму всіх цілих чисел від 1 до 15.
// let sum = 0
// for (let i = 1; i <= 15; i++) {
//     sum += i
// }
// console.log(sum)

// Знайти добуток усіх цілих чисел від 15 до 35.
// let sum = 1;
// for (let i = 15; i <= 35; i++) {
//     sum *= i
// }
// console.log(sum)

// Знайти середнє арифметичне всіх цілих чисел від 1 до 500.
// let sum = 0;
// let count = 0;
// for (let i = 0; i <= 500; i++) {
//     sum += i
//     count += 1
// }
// console.log(sum / count)

// Вивести суму лише парних чисел в діапазоні від 30 до 80.
// let sum = 0;
// for (let i = 30; i <= 80; i++) {
//     if(i % 2 == 0)
//         sum += i
// }
// console.log(sum)

// Вивести всі числа в діапазоні від 100 до 200 кратні 3.
// let sum = 0;
// for (let i = 100; i <= 200; i++) {
//     if(i % 3 == 0)
//         sum += i
// }
// console.log(sum)

// Дано натуральне число. Знайти та вивести на сторінку всі його дільники.
// Визначити кількість його парних дільників.
// Знайти суму його парних дільників.
// let n = 10;
// let amountDividers = 0;
// let amountDividersSum = 0;
// for (let i = 1; i <= n; i++) {
//     if (n % i == 0) {
//         document.write(i == n ? `${i}` : `${i},`)
//         if (i % 2 == 0) {
//             amountDividers++
//             amountDividersSum += i
//         }
//     }
// }
// document.write(`количество ${amountDividers} сумма ${amountDividersSum}`)

// Надрукувати повну таблицю множення від 1 до 10.
// for (let i = 1; i <= 10; i++) {
//     for (let j = 1; j <= 10; j++) {
//         document.write(`${j} * ${i} = ${j * i} <br>`)
//     }
//     document.write(`<br>`)
// }