'use strict'
// Вивести числа від 20 до 30 через пропуск, використовуючи крок 0,5 (20 20,5 21 21,5….).
// Один долар коштує 27 гривень. Вивести дані з розрахунком вартості 10, 20, 30... 100 доларів.
// Дане ціле число. Вивести всі цілі числа від 1 до 100, квадрат яких не перевищує числа N.
// Дане ціле число. З'ясувати, чи є воно простим (простим називається число, більше 1, які не мають інших дільників крім 1 і себе).
// Дане деяке число. Визначити, чи можна одержати це число шляхом зведення числа 3 у деякий ступінь. (Наприклад, числа 9, 81 можна отримати, а 13 - не можна).


// Вивести числа від 20 до 30 через пропуск, використовуючи крок 0,5 (20 20,5 21 21,5….).
// for (let i = 20; i <= 30; i+= 0.5) {
//     document.write(i < 30 ? `${i} ,`: `${i} `)
// }

// Один долар коштує 27 гривень. Вивести дані з розрахунком вартості 10, 20, 30... 100 доларів.
// let oneDollar = 27;
// let sumDollarsInUAH = 0;

// for (let i = 10; i <= 100; i+= 10) {
//     sumDollarsInUAH = 0;
//     sumDollarsInUAH += oneDollar * i
//     document.write(i < 100 ? `${sumDollarsInUAH} ,`: `${sumDollarsInUAH} `)
// }

// Дане ціле число. Вивести всі цілі числа від 1 до 100, квадрат яких не перевищує числа N.
// let n = 1000;
// for (let i = 1; i <= 100; i++) {
//     if(i ** 2 <= n)
//     document.write(i < 100 ? `${i} ,`: `${i} `)
// }

// Дане ціле число. З'ясувати, чи є воно простим (простим називається число, більше 1, які не мають інших дільників крім 1 і себе).
// let n = 1;
// for (let i = 0; i <= n; i++) {
//     if (n <= 1) {
//         document.write('не є простим')
//     } else if (n % i == 0) {
//         document.write(i < n ? `${i} ,` : `${i} - є простим`)
//     }
// }

// Дане деяке число. Визначити, чи можна одержати це число шляхом зведення числа 3 у деякий ступінь. 
// (Наприклад, числа 9, 81 можна отримати, а 13 - не можна).
// let n = 3;
// let numDegree = 3;
// let flag = true;
// for (let i = 1; i <= n; i++) {
//     if (numDegree ** i == n) {
//         document.write('можна отримати')
//         flag = false
//         break
//     }
// }
// if (flag == true) {
//     document.write('не можна отримати')
// }

